Конфигурация/Enums/ВидыОперацийБэкОфиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОперацийБэкОфиса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктПриемаПередачиОбъектовНедвижимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОстатковАктивовСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводПрочихАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключениеПрочегоИмуществаВСоставПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеУсловийСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделкеСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеРешенияОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонвертацияЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаРегистров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маржа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеДивидендов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеРезервовПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеСписаниеРезервов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеКупона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоставкаЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовПоКредитномуИнструменту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеДоходаПайщикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОРегистрацииПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводнаяБиржеваяСделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводноеИсполнениеОбязательствПоБиржевымСделкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСВалютой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСМО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСНедвижимостью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеЦеннойБумагиСУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЗадолженностейПоПоручению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СторнированиеМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распоряжение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/СостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Записан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПомеченНаУдаление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ИсполнениеОбязательствПоСделке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИсполнениеОбязательствПоСделке</Name>
			<BasedOn>
				<xr:Item>Document.Сделка</xr:Item>
				<xr:Item>Document.СделкаРЕПО</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКПолучению</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииСрочныхКонтрактов</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагПроданныеВРепо</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПС</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКупленныеПоРЕПО</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоЦеннымБумагам</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦенныхБумаг</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.ЗначенияНастроекУчетаЦенныхБумаг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сделки</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентНаБирже</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДепозитарныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПроцент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходЗапрещен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/CommonModules/РаботаСЖурналамиОпераций/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ВЫЗОВ ИЗ СОБЫТИЙ ДОКУМЕНТОВ

// Актуально только для документов, ссылка на которые не попадает в измерение "Документ"
// Например, "Сделка"
Процедура ПередЗаписьюДокумента(Документ) Экспорт
	
	Если Документ.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ПараметрыСеанса.ФормированиеДвиженийПоРегистрамБэкОфиса Тогда //бухгалтерия? -досвидания!
		Возврат;
	КонецЕсли;
	
	ВидОперации = Документ.Метаданные().Имя;
	
	Если ОперацияВключенаВЖурнал(ВидОперации) Тогда
		Документ.ДополнительныеСвойства.Вставить("ПредЗначенияПолейЖурналаОпераций", ПолучитьЗначенияПолейЖурналаИзДокумента(Документ.Ссылка));
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюДокумента

Процедура ПриЗаписиДокумента(Документ) Экспорт
	
	Если НЕ ПараметрыСеанса.ФормированиеДвиженийПоРегистрамБэкОфиса Тогда //бухгалтерия? -досвидания!
		Возврат;
	КонецЕсли;
	
	ВидОперации = Документ.Метаданные().Имя;
	
	Если ОперацияВключенаВЖурнал(ВидОперации) Тогда
		ЗарегистрироватьОперациюВЖурнале(Документ);
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписиДокумента

Процедура ПередУдалениемДокумента(Документ) Экспорт

	ВидОперации = Документ.Метаданные().Имя;
	
	Если ОперацияВключенаВЖурнал(ВидОперации) Тогда
		УдалитьОперациюИзЖурнала(Документ);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// РАБОТА СО СВОДНЫМИ ФОРМАМИ

Функция СформироватьКлючСводнойФормы(ИмяФормы, ПараметрыФормы) Экспорт
	
	СоставКлючаСводнойФормы = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("Организация, Дата, СчетДоверительногоУправления, Брокер, МестоХранения, Рынок, Состояние", ",", Истина, Истина);
	
	КлючСводнойФормы = ИмяФормы;
	
	Для каждого ПолеКлючаСводнойФормы Из СоставКлючаСводнойФормы Цикл
		
		ЗнчПоляКлючаСводнойФормы = ПараметрыФормы[ПолеКлючаСводнойФормы];
		
		Если      ТипЗнч(ЗнчПоляКлючаСводнойФормы) = Тип("Дата") Или ТипЗнч(ЗнчПоляКлючаСводнойФормы) = Тип("Число") Или ТипЗнч(ЗнчПоляКлючаСводнойФормы) = Тип("Строка") Тогда
			КлючСводнойФормы = КлючСводнойФормы + "_" + Строка(ЗнчПоляКлючаСводнойФормы);
		ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ЗнчПоляКлючаСводнойФормы)) Тогда
			КлючСводнойФормы = КлючСводнойФормы + "_" + ЗнчПоляКлючаСводнойФормы.УникальныйИдентификатор();
		ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(ЗнчПоляКлючаСводнойФормы)) Тогда
			КлючСводнойФормы = КлючСводнойФормы + "_" + РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЗнчПоляКлючаСводнойФормы);
		Иначе
			Сообщить("Не удалось сформировать идентификатор сводной формы. Неверный тип параметра " + ПолеКлючаСводнойФормы + ". Обратитесь к разработчикам.");
			Возврат Новый УникальныйИдентификатор();
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КлючСводнойФормы;
	
КонецФункции // СформироватьКлючСводнойФормы

Функция ПолучитьРеквизитыСводнойФормы(Документ) Экспорт
	
	ЗначенияПолейЖурнала = ПолучитьЗначенияПолейЖурналаИзДокумента(Документ);
	
	Если      ЗначенияПолейЖурнала.ВидОперации = Перечисления.ВидыОперацийБэкОфиса.СводнаяБиржеваяСделка Тогда
		ЗначенияПолейЖурнала.Вставить("ИмяФормы", "ОбщаяФорма.СводнаяБиржеваяСделка");
	ИначеЕсли ЗначенияПолейЖурнала.ВидОперации = Перечисления.ВидыОперацийБэкОфиса.СводноеИсполнениеОбязательствПоБиржевымСделкам Тогда
		ЗначенияПолейЖурнала.Вставить("ИмяФормы", "ОбщаяФорма.СводноеИсполнениеБиржевыхСделок");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	// проверим, а есть ли запись в журнале, удовлетворяющая данным полям
	МенеджерЗаписи = РегистрыСведений.ЖурналОперацийБэкОфиса.СоздатьМенеджерЗаписи();
	
	Для каждого Измерение Из Метаданные.РегистрыСведений.ЖурналОперацийБэкОфиса.Измерения Цикл
		МенеджерЗаписи[Измерение.Имя] = ЗначенияПолейЖурнала[Измерение.Имя];
	КонецЦикла;	
	
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// осталось только получить ключ уникальности формы
	ЗначенияПолейЖурнала.Вставить("КлючФормы",  СформироватьКлючСводнойФормы(ЗначенияПолейЖурнала.ИмяФормы, ЗначенияПолейЖурнала));
	
	Возврат ЗначенияПолейЖурнала;
	
КонецФункции // ПолучитьРеквизитыСводнойФормы

Функция ПолучитьВариантыСводнойФормы(ВыборкаДокументы) Экспорт
	
	ВариантыИсполнений = Новый Массив();
		
	Пока ВыборкаДокументы.Следующий() Цикл
		
		// получим реквизиты сводной формы
		РеквизитыСводнойФормы = ПолучитьРеквизитыСводнойФормы(ВыборкаДокументы.Ссылка);
		
		ЕстьАналогичныеРеквизитыСводнойФормы = Ложь;
		
		// проверим, а вдруг такие рекизиты исполнения уже были зафиксированы
		Для каждого ВариантИсполнения Из ВариантыИсполнений Цикл
			
			ЕстьАналогичныеРеквизитыСводнойФормы = Истина;
			
			Для каждого КлючЗнч Из ВариантИсполнения Цикл
				Если ВариантИсполнения[КлючЗнч.Ключ] <> РеквизитыСводнойФормы[КлючЗнч.Ключ] Тогда
					ЕстьАналогичныеРеквизитыСводнойФормы = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ЕстьАналогичныеРеквизитыСводнойФормы Тогда
				Прервать;
			КонецЕсли;
				
		КонецЦикла;			
		
		Если Не ЕстьАналогичныеРеквизитыСводнойФормы Тогда
			ВариантыИсполнений.Добавить(РеквизитыСводнойФормы);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВариантыИсполнений;
	
КонецФункции // ПолучитьВариантыСводныхФорм

////////////////////////////////////////////////////////////////////////////////

Функция ОперацияВключенаВЖурнал(ВидОперации) Экспорт
	
	Возврат Не (Метаданные.Перечисления.ВидыОперацийБэкОфиса.ЗначенияПеречисления.Найти(ВидОперации) = Неопределено);
	
КонецФункции // ОперацияВключенаВЖурнал

Функция ПолучитьСтруктуруПолейЖурнала()
	
	СтруктураПолей = Новый Структура;
	
	ЖурналОперацийМД = Метаданные.РегистрыСведений.ЖурналОперацийБэкОфиса;
	
	Для каждого Поле Из ЖурналОперацийМД.Измерения Цикл
		СтруктураПолей.Вставить(Поле.Имя);
	КонецЦикла;
	
	Для каждого Поле Из ЖурналОперацийМД.Ресурсы Цикл
		СтруктураПолей.Вставить(Поле.Имя);
	КонецЦикла;
	
	Для каждого Поле Из ЖурналОперацийМД.Реквизиты Цикл
		СтруктураПолей.Вставить(Поле.Имя);
	КонецЦикла;
	
	Возврат СтруктураПолей;
	
КонецФункции // ПолучитьСтруктуруПолейЖурнала

Процедура УстановитьЗначенияРасчетныхПолейЖурнала(ЗнчПолейЖурнала, Документ)
	
	ВидыОперацийЖурнала = Перечисления.ВидыОперацийБэкОфиса;
	
	// "перекроем" значения расчетных полей
	ДокументМД  = Документ.Метаданные();
	ВидОперации = ДокументМД.Имя;
	
	// значения, общие для всех документов
	ЗнчПолейЖурнала.Документ    = Документ.Ссылка;
	ЗнчПолейЖурнала.ВидОперации = ВидыОперацийЖурнала[ВидОперации];
	ЗнчПолейЖурнала.Состояние   = Перечисления.СостоянияДокументов.ПолучитьСостояниеДокумента(Документ);
	
	ЗнчПолейЖурнала.ПредставлениеОперации = Строка(Документ);
	
	// ценные бумаги, [рынок]
	Если      ВидОперации = "КонвертацияЦенныхБумаг" Тогда
		ЗнчПолейЖурнала.ЦеннаяБумага = Документ.ЦеннаяБумага;
		
	ИначеЕсли ВидОперации = "ПогашениеКупона" Тогда
		ЗнчПолейЖурнала.ЦеннаяБумага = Документ.Облигация;
		ЗнчПолейЖурнала.Рынок        = Перечисления.РынкиЦенныхБумаг.Облигации;

	ИначеЕсли ВидОперации = "ВводЦенныхБумаг" Или ВидОперации = "ВыводЦенныхБумаг"
		Или ВидОперации = "ПереводЦенныхБумаг" Или ВидОперации = "ПоставкаЦенныхБумаг"
		Или ВидОперации = "ИзменениеУсловийСделки"
		Или ((ВидОперации = "Сделка" Или ВидОперации = "ИсполнениеОбязательствПоСделке") И ЗнчПолейЖурнала.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок)
	Тогда
		Если Документ.ЦенныеБумаги.Количество() = 1 Тогда
			ЗнчПолейЖурнала.ЦеннаяБумага = Документ.ЦенныеБумаги[0].ЦеннаяБумага;
		КонецЕсли;
		
	КонецЕсли;
	
	// место хранения
	Если ДокументМД.Реквизиты.Найти("МестоХранения") = Неопределено Тогда
		ЗнчПолейЖурнала.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок;
	КонецЕсли;
	
	// прочие
	Если      ВидОперации = "Сделка" И ЗначениеЗаполнено(ЗнчПолейЖурнала.МестоХранения) И ЗнчПолейЖурнала.МестоХранения <> Справочники.МестаХранения.ВнебиржевойРынок Тогда
		ЗнчПолейЖурнала.Документ      = Неопределено;
		ЗнчПолейЖурнала.Ответственный = Справочники.Пользователи.ПустаяСсылка();
		ЗнчПолейЖурнала.Комментарий   = "";
		ЗнчПолейЖурнала.Дата          = НачалоДня(ЗнчПолейЖурнала.Дата) + 10*60*60;
		ЗнчПолейЖурнала.ВидОперации   = ВидыОперацийЖурнала.СводнаяБиржеваяСделка;
		
		ЗнчПолейЖурнала.ПредставлениеОперации = "Биржевые операции"
			+ ?(ЗначениеЗаполнено(ЗнчПолейЖурнала.Рынок), ", " + ЗнчПолейЖурнала.Рынок, "")
			+ ?(ЗначениеЗаполнено(ЗнчПолейЖурнала.Брокер), ", " + ЗнчПолейЖурнала.Брокер, "");
			
	ИначеЕсли ВидОперации = "ИсполнениеОбязательствПоСделке" И ЗначениеЗаполнено(ЗнчПолейЖурнала.МестоХранения) И ЗнчПолейЖурнала.МестоХранения <> Справочники.МестаХранения.ВнебиржевойРынок Тогда
		ЗнчПолейЖурнала.Документ      = Неопределено;
		ЗнчПолейЖурнала.Ответственный = Справочники.Пользователи.ПустаяСсылка();
		ЗнчПолейЖурнала.Комментарий   = "";
		ЗнчПолейЖурнала.Дата          = НачалоДня(ЗнчПолейЖурнала.Дата) + ?(ЗнчПолейЖурнала.Брокер = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_ГПБ"), 9*60*60+30*60, 17*60*60);
		ЗнчПолейЖурнала.ВидОперации   = ВидыОперацийЖурнала.СводноеИсполнениеОбязательствПоБиржевымСделкам;
		
		ЗнчПолейЖурнала.ПредставлениеОперации = "Исполнения биржевых сделок"
			+ ?(ЗначениеЗаполнено(ЗнчПолейЖурнала.Рынок), ", " + ЗнчПолейЖурнала.Рынок, "")
			+ ?(ЗначениеЗаполнено(ЗнчПолейЖурнала.Брокер), ", " + ЗнчПолейЖурнала.Брокер, "");
			
	ИначеЕсли ВидОперации = "ПоставкаЦенныхБумаг" И ЗначениеЗаполнено(Документ.Основание) Тогда
		ЗнчПолейЖурнала.МестоХранения = Документ.Основание.МестоХранения;
		ЗнчПолейЖурнала.Брокер        = Документ.Основание.Брокер;
		
	КонецЕсли;
	
	// номер и представление вида документа
	Если ЗнчПолейЖурнала.ВидОперации = ВидыОперацийЖурнала.СводнаяБиржеваяСделка
		Или ЗнчПолейЖурнала.ВидОперации = ВидыОперацийЖурнала.СводноеИсполнениеОбязательствПоБиржевымСделкам
	Тогда
		ЗнчПолейЖурнала.ПредставлениеВидаОперации = Строка(ЗнчПолейЖурнала.ВидОперации);
		
		// Уберем из ключевых полей
		ЗнчПолейЖурнала.Удалить("Номер");
		
	Иначе
		ЗнчПолейЖурнала.Номер = СокрЛП(Документ.Номер);
		
		// из представления документа нужно отрезать номер и все, что расположено справа от него
		ЗнчПолейЖурнала.ПредставлениеВидаОперации = Лев(
			ЗнчПолейЖурнала.ПредставлениеОперации,
			Найти(ЗнчПолейЖурнала.ПредставлениеОперации, " " + ЗнчПолейЖурнала.Номер + " ") - 1);
		
	КонецЕсли;
	
	// сумма
	Если      ВидОперации = "ВводЦенныхБумаг" Тогда
	    ЗнчПолейЖурнала.Сумма = Документ.ЦенныеБумаги.Итог("Сумма");
	ИначеЕсли ВидОперации = "ВыводЦенныхБумаг" Тогда
	    ЗнчПолейЖурнала.Сумма = Документ.ЦенныеБумаги.Итог("СуммаРынок");
	ИначеЕсли ВидОперации = "Оплата" Тогда
	    ЗнчПолейЖурнала.Сумма = Документ.Основания.Итог("Сумма");
		Если ЗнчПолейЖурнала.Сумма = 0 Тогда
			ЗнчПолейЖурнала.Сумма = Документ.Основания.Итог("СуммаКупона");
		КонецЕсли;
	ИначеЕсли ВидОперации = "ПогашениеКупона" Тогда
	    ЗнчПолейЖурнала.Сумма = Документ.СуммаКупона;
	ИначеЕсли ВидОперации = "ПоставкаЦенныхБумаг" Тогда
	    ЗнчПолейЖурнала.Сумма = Документ.ЦенныеБумаги.Итог("Сумма");
	ИначеЕсли ВидОперации = "НачислениеЗадолженности" Тогда
	    ЗнчПолейЖурнала.Сумма = Документ.Основания.Итог("Сумма");
	ИначеЕсли ВидОперации = "Сделка" И ЗнчПолейЖурнала.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок Тогда
	    ЗнчПолейЖурнала.Сумма = Документ.ЦенныеБумаги.Итог("Сумма");
	ИначеЕсли ВидОперации = "СделкаРЕПО" Тогда
	    ЗнчПолейЖурнала.Сумма = Документ.ЦенныеБумаги.Итог("Сумма");
	КонецЕсли;
	
	// типизация значения ключевых полей, чтобы исключить проблемы при поиске расхождений
	Если Не ЗначениеЗаполнено(ЗнчПолейЖурнала.Рынок) Тогда
		ЗнчПолейЖурнала.Рынок = Перечисления.РынкиЦенныхБумаг.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗнчПолейЖурнала.МестоХранения) Тогда
		ЗнчПолейЖурнала.МестоХранения = Справочники.МестаХранения.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗнчПолейЖурнала.Брокер) Тогда
		ЗнчПолейЖурнала.Брокер = Справочники.БрокерскиеКомпании.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗнчПолейЖурнала.Сумма) Тогда
		ЗнчПолейЖурнала.Сумма = 0;
	КонецЕсли;
	
КонецПроцедуры // УстановитьЗначенияРасчетныхПолейЖурнала

Функция ПолучитьЗначенияПолейЖурналаИзДокумента(Документ) Экспорт
	
	ЗнчПолейЖурнала = ПолучитьСтруктуруПолейЖурнала();
	ЗаполнитьЗначенияСвойств(ЗнчПолейЖурнала, Документ);
	
	УстановитьЗначенияРасчетныхПолейЖурнала(ЗнчПолейЖурнала, Документ);
	
	Возврат ЗнчПолейЖурнала;
	
КонецФункции // ПолучитьЗначенияПолейЖурналаИзДокумента

Процедура ЗаполнитьИзмеренияЖурналаЗначениями(ЗаписьЖурнала, ЗнчПолейЖурнала)
	
	ЗаписьЖурнала.Организация                  = ЗнчПолейЖурнала.Организация;
	ЗаписьЖурнала.Дата                         = ЗнчПолейЖурнала.Дата;
	ЗаписьЖурнала.СчетДоверительногоУправления = ЗнчПолейЖурнала.СчетДоверительногоУправления;
	ЗаписьЖурнала.Брокер                       = ЗнчПолейЖурнала.Брокер;
	ЗаписьЖурнала.МестоХранения                = ЗнчПолейЖурнала.МестоХранения;
	ЗаписьЖурнала.Рынок                        = ЗнчПолейЖурнала.Рынок;
	ЗаписьЖурнала.Документ                     = ЗнчПолейЖурнала.Документ;
	ЗаписьЖурнала.ВидОперации                  = ЗнчПолейЖурнала.ВидОперации;
	ЗаписьЖурнала.Состояние                    = ЗнчПолейЖурнала.Состояние;
	
КонецПроцедуры // ЗаполнитьИзмеренияЖурналаЗначениями


Функция ДобавитьЭлементБлокировки(Блокировка, Документ, ИзПредыдущегоСостояния)
	
	// По-особому у нас обрабатываются только биржевые сделки и их исполнения, т.к. по этим документам
	// создаются сводные записи, в которых отсутствует ссылка на сам документ
	
	// Т.к. сводная запись по набору измерений м.б. только одна, то на точное расчетное время, которое зависит от
	// типа документа и брокера, нам пофигу. Для блокировки вполне достаточно, чтобы оно было общим за день,
	// поэтому приводим его к началу дня
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЖурналОперацийБэкОфиса");
	
	Если ИзПредыдущегоСостояния Тогда
		РеквизитыДокумента = Документ.ДополнительныеСвойства.ПредЗначенияРеквизитовШапки;
	Иначе
		РеквизитыДокумента = Документ;
	КонецЕсли;		
	
	Если      ТипЗнч(Документ) = Тип("ДокументОбъект.Сделка") И РеквизитыДокумента.МестоХранения <> Справочники.МестаХранения.ВнебиржевойРынок Тогда
		
		ЭлементБлокировки.УстановитьЗначение("Дата",                         НачалоДня(РеквизитыДокумента.Дата));
		ЭлементБлокировки.УстановитьЗначение("Организация",                  РеквизитыДокумента.Организация);
		ЭлементБлокировки.УстановитьЗначение("СчетДоверительногоУправления", РеквизитыДокумента.СчетДоверительногоУправления);
		ЭлементБлокировки.УстановитьЗначение("Брокер",                       РеквизитыДокумента.Брокер);
		ЭлементБлокировки.УстановитьЗначение("ВидОперации",                  Перечисления.ВидыОперацийБэкОфиса.СводнаяБиржеваяСделка);
		ЭлементБлокировки.УстановитьЗначение("Документ",                     Документы.Сделка.ПустаяСсылка());
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.ИсполнениеОбязательствПоСделке") И РеквизитыДокумента.МестоХранения <> Справочники.МестаХранения.ВнебиржевойРынок Тогда
		
		ЭлементБлокировки.УстановитьЗначение("Дата",                         НачалоДня(РеквизитыДокумента.Дата));
		ЭлементБлокировки.УстановитьЗначение("Организация",                  РеквизитыДокумента.Организация);
		ЭлементБлокировки.УстановитьЗначение("СчетДоверительногоУправления", РеквизитыДокумента.СчетДоверительногоУправления);
		ЭлементБлокировки.УстановитьЗначение("Брокер",                       РеквизитыДокумента.Брокер);
		ЭлементБлокировки.УстановитьЗначение("ВидОперации",                  Перечисления.ВидыОперацийБэкОфиса.СводноеИсполнениеОбязательствПоБиржевымСделкам);
		ЭлементБлокировки.УстановитьЗначение("Документ",                     Документы.ИсполнениеОбязательствПоСделке.ПустаяСсылка());
		
	Иначе
		
		ЭлементБлокировки.УстановитьЗначение("Документ", Документ.Ссылка);
		
	КонецЕсли;
	
КонецФункции // ДобавитьЭлементБлокировки

Процедура УстановитьБлокировкуЖурнала(Документ)
	
	Если МонопольныйРежим() Тогда
		Возврат;                                                          
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	
	// блокировка по новому состоянию документа
	ДобавитьЭлементБлокировки(Блокировка, Документ, Ложь);
	
	// для ранее записанных документо заблокируемм также и старое состояние;
	// даже если оно продублирует новое состояние - ничего страшного
	Если Документ.ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда
		// #ТехДолг 21.05.2020 Сережа К
		//	оказывается, не все документ перед записью (корректировка, в частности) вызывают общие механизмы,
		//	которые заполняют доп. свойства; в рамках задачи #318696 нужно написать инструкцию и скрипт
		//	для проверки всех объектов мд на соответствие ей
		Если Не Документ.ДополнительныеСвойства.ЭтоНовый Тогда
			ДобавитьЭлементБлокировки(Блокировка, Документ, Истина);
		КонецЕсли;
	КонецЕсли;
	
	Блокировка.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировкуЖурнала

Процедура УдалитьОперациюИзЖурнала(Документ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// установим блокировку
	УстановитьБлокировкуЖурнала(Документ);
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.Сделка") И Документ.МестоХранения <> Справочники.МестаХранения.ВнебиржевойРынок Тогда
		
		ЗнчПолейЖурнала = ПолучитьЗначенияПолейЖурналаИзДокумента(Документ);
		
		Если Не ЕстьАналогичныеБиржевыеСделки(ЗнчПолейЖурнала, Документ) Тогда
			// запись удаляем только тогда, когда не осталось больше аналогичных документов
			НаборЗаписейЖурнала = РегистрыСведений.ЖурналОперацийБэкОфиса.СоздатьНаборЗаписей();

			Для каждого ЭлементОтбора Из НаборЗаписейЖурнала.Отбор Цикл
				ЭлементОтбора.Установить(ЗнчПолейЖурнала[ЭлементОтбора.Имя]);
			КонецЦикла;
			
			НаборЗаписейЖурнала.Записать();
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.ИсполнениеОбязательствПоСделке") И Документ.МестоХранения <> Справочники.МестаХранения.ВнебиржевойРынок Тогда
		
		ЗнчПолейЖурнала = ПолучитьЗначенияПолейЖурналаИзДокумента(Документ);
		
		Если Не ЕстьАналогичныеИсполнениеОбязательствПоСделке(ЗнчПолейЖурнала, Документ) Тогда
			// запись удаляем только тогда, когда не осталось больше аналогичных документов
			НаборЗаписейЖурнала = РегистрыСведений.ЖурналОперацийБэкОфиса.СоздатьНаборЗаписей();

			Для каждого ЭлементОтбора Из НаборЗаписейЖурнала.Отбор Цикл
				ЭлементОтбора.Установить(ЗнчПолейЖурнала[ЭлементОтбора.Имя]);
			КонецЦикла;
			
			НаборЗаписейЖурнала.Записать();
		КонецЕсли;
		
	Иначе
		
		НаборЗаписейЖурнала = РегистрыСведений.ЖурналОперацийБэкОфиса.СоздатьНаборЗаписей();
		НаборЗаписейЖурнала.Отбор.Документ.Установить(Документ.Ссылка);
		НаборЗаписейЖурнала.Записать();
	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // УдалитьОперациюИзЖурнала

Процедура ЗарегистрироватьОперациюВЖурнале(Документ)
	
	// проверим, а есть ли вид данного документа, среди видов документов УК
	ВидОперации = Документ.Метаданные().Имя;
	
	// в целях ускорения записи, проверим, изменились ли значения ключевых полей
	// для тех документов, у которых зафиксированы пред. значения (например, сводные сделки)
	Если Документ.ДополнительныеСвойства.Свойство("ПредЗначенияПолейЖурналаОпераций") Тогда
		ЕстьИзмененияКлючевыхПолей = Ложь;
		
		ТекущиеЗначенияПолейЖурналаОпераций = ПолучитьЗначенияПолейЖурналаИзДокумента(Документ);
		
		Для каждого КлючЗначение Из ТекущиеЗначенияПолейЖурналаОпераций Цикл
			Если КлючЗначение.Значение <> Документ.ДополнительныеСвойства.ПредЗначенияПолейЖурналаОпераций[КлючЗначение.Ключ] Тогда
				ЕстьИзмененияКлючевыхПолей = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЕстьИзмененияКлючевыхПолей Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// установим блокировку
	УстановитьБлокировкуЖурнала(Документ);
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.Сделка") Тогда
		
		ОтменитьРегистрациюБиржевойСделки(Документ);
		
		Если Документ.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок Тогда
			ЗарегистрироватьДокумент(Документ);
		Иначе
			ЗарегистрироватьБиржевуюСделку(Документ);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.ИсполнениеОбязательствПоСделке") Тогда
		
		ОтменитьРегистрациюИсполненияОбязательствПоСделке(Документ);
		
		Если Документ.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок Тогда
			ЗарегистрироватьДокумент(Документ);
		Иначе
			ЗарегистрироватьИсполнениеОбязательствПоСделке(Документ);
		КонецЕсли;
		
	Иначе	
		
		ЗарегистрироватьДокумент(Документ);
		
	КонецЕсли;
	
КонецПроцедуры // ЗарегистрироватьОперациюВЖурнале

	
Функция ЕстьАналогичныеБиржевыеСделки(ЗнчПолейЖурнала, ИсклДокумент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделка.Ссылка
		|ИЗ
		|	Документ.Сделка КАК Сделка
		|ГДЕ
		|	(Сделка.Ссылка <> &Ссылка
		|			ИЛИ &Ссылка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка))
		|	И Сделка.Организация = &Организация
		|	И ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Сделка.Дата, ДЕНЬ), ЧАС, 10) = &Дата
		|	И Сделка.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И Сделка.МестоХранения = &МестоХранения
		|	И Сделка.Брокер = &Брокер
		|	И Сделка.Рынок = &Рынок
		|	И Сделка.Проведен = &Проведен
		|	И Сделка.ПометкаУдаления = &ПометкаУдаления";
		
	Запрос.УстановитьПараметр("Организация",                  ЗнчПолейЖурнала.Организация);
	Запрос.УстановитьПараметр("Дата",                         ЗнчПолейЖурнала.Дата);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЗнчПолейЖурнала.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("МестоХранения",                ЗнчПолейЖурнала.МестоХранения);
	Запрос.УстановитьПараметр("Брокер",                       ЗнчПолейЖурнала.Брокер);
	Запрос.УстановитьПараметр("Рынок",                        ЗнчПолейЖурнала.Рынок);
	Запрос.УстановитьПараметр("Проведен",                     (ЗнчПолейЖурнала.Состояние = Перечисления.СостоянияДокументов.Проведен));
	Запрос.УстановитьПараметр("ПометкаУдаления",              (ЗнчПолейЖурнала.Состояние = Перечисления.СостоянияДокументов.ПомеченНаУдаление));
	Запрос.УстановитьПараметр("Ссылка",                       ИсклДокумент.Ссылка);

	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции // ЕстьАналогичныеБиржевыеСделки

Функция ЕстьАналогичныеИсполнениеОбязательствПоСделке(ЗнчПолейЖурнала, ИсклДокумент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсполнениеОбязательствПоСделке.Ссылка
		|ИЗ
		|	Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|ГДЕ
		|	(ИсполнениеОбязательствПоСделке.Ссылка <> &Ссылка
		|			ИЛИ &Ссылка = ЗНАЧЕНИЕ(Документ.ИсполнениеОбязательствПоСделке.ПустаяСсылка))
		|	И ИсполнениеОбязательствПоСделке.Организация = &Организация
		|	И ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ИсполнениеОбязательствПоСделке.Дата, ДЕНЬ), МИНУТА, &КоличествоМинут) = &Дата
		|	И ИсполнениеОбязательствПоСделке.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ИсполнениеОбязательствПоСделке.МестоХранения = &МестоХранения
		|	И ИсполнениеОбязательствПоСделке.Брокер = &Брокер
		|	И ИсполнениеОбязательствПоСделке.Рынок = &Рынок
		|	И ИсполнениеОбязательствПоСделке.Проведен = &Проведен
		|	И ИсполнениеОбязательствПоСделке.ПометкаУдаления = &ПометкаУдаления";
		
	Запрос.УстановитьПараметр("Организация",                  ЗнчПолейЖурнала.Организация);
	Запрос.УстановитьПараметр("Дата",                         ЗнчПолейЖурнала.Дата);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЗнчПолейЖурнала.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("МестоХранения",                ЗнчПолейЖурнала.МестоХранения);
	Запрос.УстановитьПараметр("Брокер",                       ЗнчПолейЖурнала.Брокер);
	Запрос.УстановитьПараметр("Рынок",                        ЗнчПолейЖурнала.Рынок);
	Запрос.УстановитьПараметр("Проведен",                     (ЗнчПолейЖурнала.Состояние = Перечисления.СостоянияДокументов.Проведен));
	Запрос.УстановитьПараметр("ПометкаУдаления",              (ЗнчПолейЖурнала.Состояние = Перечисления.СостоянияДокументов.ПомеченНаУдаление));
	Запрос.УстановитьПараметр("Ссылка",                       ИсклДокумент.Ссылка);
	Запрос.УстановитьПараметр("КоличествоМинут",              ?(ЗнчПолейЖурнала.Брокер = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_ГПБ"), 9*60+30, 17*60));

	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции // ЕстьАналогичныеИсполнениеОбязательствПоСделке


Процедура ОтменитьРегистрациюБиржевойСделки(Документ)
	Перем ПредЗнчПолейЖурнала, ПредМестоХранения;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не Документ.ДополнительныеСвойства.Свойство("ПредЗначенияПолейЖурналаОпераций", ПредЗнчПолейЖурнала) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПредЗнчПолейЖурнала.МестоХранения <> Справочники.МестаХранения.ВнебиржевойРынок Тогда
		
		Если Не ЕстьАналогичныеБиржевыеСделки(ПредЗнчПолейЖурнала, Документ) Тогда
			НаборЗаписейЖурнала = РегистрыСведений.ЖурналОперацийБэкОфиса.СоздатьНаборЗаписей();
			
			Для каждого ЭлементОтбора Из НаборЗаписейЖурнала.Отбор Цикл
				ЭлементОтбора.Установить(ПредЗнчПолейЖурнала[ЭлементОтбора.Имя]);
			КонецЦикла;
			
			НаборЗаписейЖурнала.Записать();
		КонецЕсли;
		
	ИначеЕсли Документ.МестоХранения <> Справочники.МестаХранения.ВнебиржевойРынок Тогда
		
		НаборЗаписейЖурнала = РегистрыСведений.ЖурналОперацийБэкОфиса.СоздатьНаборЗаписей();
		НаборЗаписейЖурнала.Отбор.Документ.Установить(Документ.Ссылка);
		НаборЗаписейЖурнала.Записать();
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ОтменитьРегистрациюБиржевойСделки

Процедура ОтменитьРегистрациюИсполненияОбязательствПоСделке(Документ)
	Перем ПредЗнчПолейЖурнала, ПредМестоХранения;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не Документ.ДополнительныеСвойства.Свойство("ПредЗначенияПолейЖурналаОпераций", ПредЗнчПолейЖурнала) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПредЗнчПолейЖурнала.МестоХранения <> Справочники.МестаХранения.ВнебиржевойРынок Тогда
		
		Если Не ЕстьАналогичныеИсполнениеОбязательствПоСделке(ПредЗнчПолейЖурнала, Документ) Тогда
			НаборЗаписейЖурнала = РегистрыСведений.ЖурналОперацийБэкОфиса.СоздатьНаборЗаписей();
			
			Для каждого ЭлементОтбора Из НаборЗаписейЖурнала.Отбор Цикл
				ЭлементОтбора.Установить(ПредЗнчПолейЖурнала[ЭлементОтбора.Имя]);
			КонецЦикла;
			
			НаборЗаписейЖурнала.Записать();
		КонецЕсли;
		
	ИначеЕсли Документ.МестоХранения <> Справочники.МестаХранения.ВнебиржевойРынок Тогда
		
		НаборЗаписейЖурнала = РегистрыСведений.ЖурналОперацийБэкОфиса.СоздатьНаборЗаписей();
		НаборЗаписейЖурнала.Отбор.Документ.Установить(Документ.Ссылка);
		НаборЗаписейЖурнала.Записать();
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ОтменитьРегистрациюИсполненияОбязательствПоСделке


Процедура ЗарегистрироватьБиржевуюСделку(Документ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// зарегистрируем запись с новым набором полей
	НовыеЗнчПолейЖурнала = ПолучитьЗначенияПолейЖурналаИзДокумента(Документ);
	
	ЗаписьЖурнала = РегистрыСведений.ЖурналОперацийБэкОфиса.СоздатьМенеджерЗаписи();
	ЗаполнитьИзмеренияЖурналаЗначениями(ЗаписьЖурнала, НовыеЗнчПолейЖурнала);
	ЗаписьЖурнала.Прочитать();
	
	Если Не ЗаписьЖурнала.Выбран() Тогда
		ЗаполнитьЗначенияСвойств(ЗаписьЖурнала, НовыеЗнчПолейЖурнала);
		ЗаписьЖурнала.Записать();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ЗарегистрироватьБиржевуюСделку

Процедура ЗарегистрироватьИсполнениеОбязательствПоСделке(Документ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// зарегистрируем запись с новым набором полей
	НовыеЗнчПолейЖурнала = ПолучитьЗначенияПолейЖурналаИзДокумента(Документ);
	
	ЗаписьЖурнала = РегистрыСведений.ЖурналОперацийБэкОфиса.СоздатьМенеджерЗаписи();
	ЗаполнитьИзмеренияЖурналаЗначениями(ЗаписьЖурнала, НовыеЗнчПолейЖурнала);
	ЗаписьЖурнала.Прочитать();
	
	Если Не ЗаписьЖурнала.Выбран() Тогда
		ЗаполнитьЗначенияСвойств(ЗаписьЖурнала, НовыеЗнчПолейЖурнала);
		ЗаписьЖурнала.Записать();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ЗарегистрироватьИсполнениеОбязательствПоСделке

Процедура ЗарегистрироватьДокумент(Документ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НовыеЗнчПолейЖурнала = ПолучитьЗначенияПолейЖурналаИзДокумента(Документ);
	
	Записывать = Неопределено;
	
	// !!! Пришлось делать через набор записей т.к. через менеджер записи 1ска НЕ РАБОТАЕТ
	НаборЗаписейЖурнала = РегистрыСведений.ЖурналОперацийБэкОфиса.СоздатьНаборЗаписей();
	НаборЗаписейЖурнала.Отбор.Документ.Установить(Документ.Ссылка);
	НаборЗаписейЖурнала.Прочитать();
	
	Если НаборЗаписейЖурнала.Количество() = 1 Тогда
		ЗаписьЖурнала = НаборЗаписейЖурнала[0];
		
		// проверим наличие изменных записей
		Записывать = Ложь;
		
		Для каждого КлючЗнч Из НовыеЗнчПолейЖурнала Цикл
			Если КлючЗнч.Значение <> ЗаписьЖурнала[КлючЗнч.Ключ] Тогда
				Записывать = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		ЗаписьЖурнала = НаборЗаписейЖурнала.Добавить();
		
		Записывать = Истина;
	КонецЕсли;
	// !!! Пришлось делать через набор записей т.к. через менеджер записи 1ска НЕ РАБОТАЕТ
	
	Если Записывать Тогда
		ЗаполнитьЗначенияСвойств(ЗаписьЖурнала, НовыеЗнчПолейЖурнала);
		НаборЗаписейЖурнала.Записать();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ЗарегистрироватьДокумент
